acervo-biblioteca-esb/acervo-biblioteca-esb/src/main/synapse-config/sequences/Polo2ObrasSequence.xml

<?xml version="1.0" encoding="UTF-8"?>
<sequence name="Polo2ObrasSequence" trace="disable" xmlns="http://ws.apache.org/ns/synapse">
    <log description="Start Retrieve Obras Polo 2 Log" level="custom">
        <property name="message" value="Starting to retrieve Polo2 obras..."/>
    </log>
    <payloadFactory description="Payload Soap" media-type="xml">
        <format>
            <soap:Envelope xmlns:dat="http://ws.wso2.org/dataservice" xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
                <soap:Header/>
                <soap:Body>
                    <dat:GetObrasWithAllPropertiesOp/>
                </soap:Body>
            </soap:Envelope>
        </format>
        <args>
            <arg value="http://ws.wso2.org/dataservice"/>
            <arg value="http://www.w3.org/2003/05/soap-envelope"/>
        </args>
    </payloadFactory>
    <header description="Soap Header" name="Action" scope="default" value="GetObrasWithAllPropertiesOp"/>
    <call>
        <endpoint key="Polo2ObrasEP"/>
    </call>
    <log description="End Retrieve Obras Polo 2 Log" level="custom">
        <property name="message" value="Finished retrieving Polo2 obras"/>
    </log>
    <log description="Log Retrieved Obras Polo 2" level="full"/>
</sequence>
